
// This is JS!

// Questions:
// 1. Неявный возврат стрелочной функции (присуще только стрелочным функциям и вроде как без {} тела функции)
// 2. Добавить README.md
// 3. Отличие инструкций от выражений (повторить в 14_instructions.js)
// 4. Деструктуризация в функциях (16_destructurization.js)
// 5. Встроенная функция (объект) Object (и его свойства, например, Object.keys(), Object.values()).
// 6. Метод массивов reduce.

// Notes:
/* 1. Для перебора объектов можно использовать и Object.keys(), Object.values() и forEach.
for ... of ... для объектов не используется. */