
// ОБЪЕКТЫ
// Объект - это набор свойств "имя: значение".
// Практически все сущности в JS - это объекты (или ведут себя как объекты).
// Если свойство объекта содержит функцию, то это свойство является методом.

// Пример объекта, содержащего метод:
console.log('Hello!')
// console - объект
// log - свойство объекта (в данном случае также является и методом обекта, т.к. содержит внутри себя функцию)
// (...) - оператор вызова метода объекта (т.е. вызывается функция, которая содержится внутри метода log)

// 01:39 Обекты